Tutorials/2D/interQHDFoam/mixingChannel/0/alphal.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    inlet2
    {
        type            fixedValue;
        value           uniform 1;
    }
    
    outlet
    {
        type		fixedGradient;
        gradient	uniform 0;
    }
    
    walls
    {
        type            slip;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
